src/app/CreateCustomOnlinePayment-OFFICIAL.XML

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:urn="urn:safetypay:contract:mws:direct" xmlns:urn1="urn:safetypay:schema:base">
   <soap:Header/>
   <soap:Body>
      <urn:CustomOnlinePaymentRequest>
         <!--Optional:-->
         <urn1:RequestDateTime>2018-03-13T14:24:59</urn1:RequestDateTime>
         <!--Optional:-->
         <urn:ApiKey>4165670f0d64615b7bccc7eaabd78c07</urn:ApiKey>
         <!--Optional:-->
         <urn:Signature>4e7067e15d6950ba344558071367a62b5e295627e6c8670402ca990272d0618e</urn:Signature>
         <!--Optional:-->
         <urn:BankID>1023</urn:BankID>
         <!--Optional:-->
         <urn:TransactionIdentifier>1</urn:TransactionIdentifier>
         <!--Optional:-->
         <urn:MerchantAccount></urn:MerchantAccount>
         <!--Optional:-->
         <urn:MerchantSalesID>Test_Integracoes</urn:MerchantSalesID>
         <!--Optional:-->
         <urn:TrackingCode></urn:TrackingCode>
         <!--Optional:-->
         <urn:ExpirationTime>120</urn:ExpirationTime>
         <!--Optional:-->
         <urn:Language>PT</urn:Language>
         <!--Optional:-->
         <urn:CountryID>BRA</urn:CountryID>
         <!--Optional:-->
         <urn:Amount CurrencyID="BRL">5.00</urn:Amount>
         <!--Optional:-->
         <urn:TransactionOkURL></urn:TransactionOkURL>
         <!--Optional:-->   
         <urn:TransactionErrorURL></urn:TransactionErrorURL>
         <urn:SendEmailToShopper>0</urn:SendEmailToShopper>
         <!--Optional:-->
         <urn1:CustomerInformation>
            <!--Zero or more repetitions:-->
             <urn1:CustomerField Key="CPF" Value="31758130890"/>
         </urn1:CustomerInformation>
         <!--Optional:-->
         <urn:ApplicationID>1</urn:ApplicationID>
      </urn:CustomOnlinePaymentRequest>
   </soap:Body>
</soap:Envelope>